ХамелионЦРПТ/src/DataProcessors/МВ_АвтоматическаяОтправкаЦРПТ/МВ_АвтоматическаяОтправкаЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МВ_АвтоматическаяОтправкаЦРПТ</name>
  <comment>(МВ) Кириченко 28.09.2020</comment>
</mdclass:DataProcessor>

ХамелионЦРПТ/src/InformationRegisters/НомераКМ_ХамелеонЦРПТ/НомераКМ_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКМ_ХамелеонЦРПТ</name>
  <resources>
    <name>OrderID</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <resources>
    <name>НомерКМ_Короткий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КМНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЗаказа</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтроки_1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/МВ_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/СтатусыДокументов_ХамелеонЦРПТ/СтатусыДокументов_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтвета</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ФайлОбработанЧастично</name>
  </enumValues>
  <enumValues>
    <name>ОтправленЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ЧерновикОбработан</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийПромежуточныйСтатус</name>
  </enumValues>
  <enumValues>
    <name>ПринятИПереданВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>КМЧастичноЭмитированы</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтветаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессе</name>
  </enumValues>
  <enumValues>
    <name>ОжидаемРегистрациюУчастникавИСМП</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПринят</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВЭДО</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/ЗаказМарок_ХамелеонЦРПТ/ЗаказМарок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказМарок_ХамелеонЦРПТ</name>
  <basedOn>Document.GS1_Обувь_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовленияСИ</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оригинал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СледующийДокумент</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЦЭМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДогоораСЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСЦЭМ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогКоличествоПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипПродукции_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СУЗОбувь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыпускаТоваров</name>
    <type>
      <types>EnumRef.СпособВыпускаТоваров_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КМНеПодлежитОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ_Табак</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварПроизведенПриобретенДо1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварВвезенВРФПосле1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвестиВОборотПослеЭмитирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтчетОбИспользовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МВ_Интегратор</name>
    <type>
      <types>CatalogRef.МВ_Интеграторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяПродукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыпускаТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСН</name>
      <type>
        <types>EnumRef.СпособФормированияСН_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСИ</name>
      <type>
        <types>EnumRef.ВидСИ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМаркировки</name>
      <type>
        <types>EnumRef.ВидМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПолучено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийБлок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаПолучения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСУЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДляСопотавления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВСД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКодаМаркировки</name>
      <type>
        <types>EnumRef.ТипКодаМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоЧаса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КМИзAPI</name>
    <attributes>
      <name>Order_Id_Line</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ_Короткий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/DataProcessors/МВ_АвтоматическаяОтправкаЦРПТ/Forms/Форма/Module.bsl
#Область ОтравитьЦРПТ

&НаКлиенте
Процедура ОтправитьВЦРПТ(Команда) Экспорт
	
	МассивСсылок = ПолучитьМассив_НЕ_ОтправленныхЗаказовМарок();
	
	Для Каждого ДокументЗаказМарок Из МассивСсылок Цикл
		ФормЗаказаМарок = ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента", Новый Структура("Ключ", ДокументЗаказМарок));
		ФормЗаказаМарок.ОтправитьВЦРПТ(Команда);
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассив_НЕ_ОтправленныхЗаказовМарок()
	
	МассивСсылок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказМарок_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Документ.ЗаказМарок_ХамелеонЦРПТ КАК ЗаказМарок_ХамелеонЦРПТ
		|ГДЕ
		|	ЗаказМарок_ХамелеонЦРПТ._Order_ID = """"
		|	И (ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.Обработан)
		|			ИЛИ ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.ОжидаетОтвета)
		|			ИЛИ ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.ПодготовленКОтправке)
		|			ИЛИ ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.ОжидаетОтветаОтКлиента))
		|	И ЗаказМарок_ХамелеонЦРПТ.Проведен = ИСТИНА";
	

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		МассивСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
КонецФункции

#КонецОбласти

#Область ПолучитьКМ

&НаКлиенте
Процедура ПолучитьКМИзAPI(Команда) Экспорт
	
	МассивСсылок = ПолучитьМассивОтправленныхЗаказовМарок();
	
	Для Каждого ДокументЗаказМарок Из МассивСсылок Цикл
		ФормЗаказаМарок = ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента", Новый Структура("Ключ", ДокументЗаказМарок));
		ФормЗаказаМарок.ПолучитьКМИзAPI(Неопределено);
	КонецЦикла;;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивОтправленныхЗаказовМарок()
	
	МассивСсылок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказМарок_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Документ.ЗаказМарок_ХамелеонЦРПТ КАК ЗаказМарок_ХамелеонЦРПТ
		|ГДЕ
		|	ЗаказМарок_ХамелеонЦРПТ._Order_ID <> """"
		|	И ЗаказМарок_ХамелеонЦРПТ.Дата >= ДАТАВРЕМЯ(2020, 9, 21, 0, 0, 0)
		|	И (ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.Отправлен)
		|			ИЛИ ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.ОтправленВЭДО)
		|			ИЛИ ЗаказМарок_ХамелеонЦРПТ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.ВПроцессе))
		|	И ЗаказМарок_ХамелеонЦРПТ.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		МассивСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
КонецФункции

#КонецОбласти

#Область ЗаписатьВПапкуКМ

&НаКлиенте
Процедура СохранитьВcsvВыделенныеЗаказы(Команда) Экспорт
	МассивСсылок = ПолучитьМассивЭмитированныхЗаказовМарок();
	
	Для Каждого ДокументЗаказМарок Из МассивСсылок Цикл
		
		Каталог = "";
		Количество = 0;
		GTINСтрока = "";
		ИД_Организации_в_ОКТО ="";
		ДвоичныеДанные = СохранитьФайлНаДиске(ДокументЗаказМарок, GTINСтрока, Каталог, Количество);
		Если Каталог = "" Тогда
			Каталог =  "C:\temp" ;
		КонецЕсли;	
		Если ДвоичныеДанные <> Неопределено Тогда 
			//++ МВ:Овчинников 24.05.2021  •0
			//idкомпании_gtin_количество_дата (ДДММГГ)_время (ччммсс).csv
			ИмяФайла = Каталог+"\"+ИД_Организации_в_ОКТО+СтрЗаменить(СокрЛП(GTINСтрока),Символ("160"),"")+"_"+Количество+"_"+Формат(ТекущаяДата(),"ДФ=ddMMyy_HHmmss")+".csv";
			//-- МВ:Овчинников 24.05.2021

			ДвоичныеДанные.Записать(ИмяФайла);
		КонецЕсли;
	Конеццикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивЭмитированныхЗаказовМарок()
	
	МассивСсылок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказМарок_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Документ.ЗаказМарок_ХамелеонЦРПТ.КМИзAPI КАК ЗаказМарок_ХамелеонЦРПТ
		|ГДЕ
		|	ЗаказМарок_ХамелеонЦРПТ.Ссылка._Order_ID <> """"
		|	И ЗаказМарок_ХамелеонЦРПТ.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован)
		|	И ЗаказМарок_ХамелеонЦРПТ.Ссылка.Проведен = ИСТИНА
		|	И НЕ ЗаказМарок_ХамелеонЦРПТ.Статус ПОДОБНО ""%НАПЕЧАТАН%""
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказМарок_ХамелеонЦРПТ.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		МассивСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьФайлНаДиске(Ссылка, GTINСтрока, Каталог, Количество)
	Количество = 0;	

	ДанныеТекст = Новый ТекстовыйДокумент;
	GTINСтрока = "";
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл 
		Если ЗначениеЗаполнено(GTINСтрока) Тогда 
			GTINСтрока = GTINСтрока + ",";
		КонецЕсли;
		GTINСтрока = GTINСтрока + СтрокаТовары.GTIN.GTIN;
	КонецЦикла;
	
	GTINСтрока = Лев(GTINСтрока, 170);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераКМ_ХамелеонЦРПТ.НомерКМ КАК НомерКМ
		|ИЗ
		|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
		|ГДЕ
		|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа
		|	И НомераКМ_ХамелеонЦРПТ.КМНапечатан = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		Для Каждого КМИзДокумента ИЗ Ссылка.КМИзAPI Цикл
			ДанныеСтрока = РаскодироватьСтроку(КМИзДокумента.НомерКМ, СпособКодированияСтроки.КодировкаURL);
			ДанныеТекст.ДобавитьСтроку(ДанныеСтрока);
		Конеццикла;
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
			ДанныеСтрока = РаскодироватьСтроку(Выборка.НомерКМ, СпособКодированияСтроки.КодировкаURL);
			ДанныеТекст.ДобавитьСтроку(ДанныеСтрока);	
		КонецЦикла;	
		
	КонецеслИ;
	
	Если ДанныеТекст.КоличествоСтрок() > 0 Тогда 
		ВременныйФайлТекст = ПолучитьИмяВременногоФайла();
		ДанныеТекст.Записать(ВременныйФайлТекст, КодировкаТекста.UTF8);
		ДанныеДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайлТекст);
	    Строка64 = Base64Строка(ДанныеДвоичныеДанные);
	    Строка64 = Прав(Строка64,СтрДлина(Строка64)-4);
	    ДанныеДвоичныеДанные = Base64Значение(Строка64);
		УдалитьФайлы(ВременныйФайлТекст);
		
		ДокументЗаказаОбъект = Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаКМ Из ДокументЗаказаОбъект.КМИзAPI Цикл 
			СтрокаКМ.Статус = "НАПЕЧАТАН";
		КонецЦикла;
		
		Попытка
			ДокументЗаказаОбъект.Записать();
		Исключение КонецПопытки;
		
		ДанныеНомераКМ = РегистрыСведений.НомераКМ_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		ДанныеНомераКМ.Отбор.ДокументЗаказа.Установить(Ссылка);
		ДанныеНомераКМ.Прочитать();
		
		Для Каждого ЗаписьНомераКМ Из ДанныеНомераКМ Цикл 
			ЗаписьНомераКМ.КМНапечатан = Истина;
		КонецЦикла;
		
		ДанныеНомераКМ.Записать(Истина);
		
		//++ МВ:Овчинников 21.05.2021  •0
		//id для ЛК Калача  - dcc9df8b-1955-43e2-be30-29ec0c5da619
		//id для "Малыш" - 6c2f1250-0f84-47a6-a2fe-04ea8abacc11
		ИД_Организации_в_ОКТО = РегистрыСведений.МВ_ДополнительныеНастройки.ПолучитьЗначения(ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек.ОКТОИдентификаторОрганизации, ТекущаяДата(),Ссылка.Организация);
		Каталог = РегистрыСведений.МВ_ДополнительныеНастройки.ПолучитьЗначения(ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек.ОКТОКаталогФайловДляЗагрузкиКМ, ТекущаяДата(),Ссылка.Организация);
		//-- МВ:Овчинников 21.05.2021
		Если Каталог = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Каталог) Тогда 
			Каталог = Ссылка.МВ_Интегратор.КаталогВыгрузкиКодов;
		КонецЕсли;	
		Количество =  ДанныеТекст.КоличествоСтрок();
		Возврат ДанныеДвоичныеДанные; 
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
